In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
df = pd.read_csv('hiring.csv')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df['test_score(out of 10)'].mean()

7.857142857142857

In [5]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].mean())

In [6]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN               8.000000                           9      50000
1        NaN               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [7]:
df.experience = df.experience.fillna('zero')

In [8]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [9]:
!pip install word2number

Collecting word2number
  Using cached word2number-1.1-py3-none-any.whl
Installing collected packages: word2number
Successfully installed word2number-1.1

WARNING: You are using pip version 21.1.2; however, version 21.2.1 is available.
You should consider upgrading via the 'c:\python_env\datascience\venv_datascience\scripts\python.exe -m pip install --upgrade pip' command.

In [10]:
from word2number import w2n

In [11]:
df.experience = df.experience.apply(w2n.word_to_num)

In [12]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [13]:
reg = linear_model.LinearRegression()

In [14]:
reg

LinearRegression()

In [15]:
reg.fit(df[['experience','test_score(out of 10)', 'interview_score(out of 10)']], df[['salary($)']])

LinearRegression()

In [16]:
reg.predict([[2,9,6]])

array([[53290.89255945]])

In [17]:
reg.predict([[12,10,10]])

array([[92268.07227784]])